import streamlit as st

st.set_page_config(page_title="ML & NN Web App", layout="wide")

st.title("Intelligent System")
st.header("⬅️ ใช้เมนูด้านซ้ายเพื่อเลือกหน้าที่ต้องการ")

st.header("แนะนำตัว")
st.write("ชื่อ : นายภัทรกร ยุทธเทพา")
st.write("รหัสนักศึกษา : 6604062630412")
st.write("สาขาวิชา : วิทยาการคอมพิวเตอร์")
st.write("คณะ : วิทยาศาสตร์")

st.header("📌 **เกี่ยวกับโปรเจค**")
st.write("โปรเจคนี้เป็นส่วนหนึ่งของวิชา Intelligent System (040613701)")
st.write("โดยจะเป็นการนำเสนอเนื้อหาที่เกี่ยวข้องกับ Machine Learning และ Neural Network")
st.write("โดยจะมีการนำเสนอเนื้อหาเกี่ยวกับการพัฒนาโมเดล SVM และ Random Forest และการพยากรณ์ราคาหุ้นของ Nvidia ด้วย LSTM")

